<?xml version="1.0" ?>
<net batch="1" name="frozen_model" version="5">
	<layers>
		<layer id="0" name="input1" precision="FP32" type="Input">
			<output>
				<port id="0">
					<dim>400</dim>
					<dim>300</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="Reshape/shape/Output_0/Data__const" precision="FP32" type="Const">
			<output>
				<port id="1">
					<dim>4</dim>
				</port>
			</output>
			<blobs>
				<custom offset="0" size="16"/>
			</blobs>
		</layer>
		<layer id="2" name="Reshape" precision="FP32" type="Reshape">
			<input>
				<port id="0">
					<dim>400</dim>
					<dim>300</dim>
				</port>
				<port id="1">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>400</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>300</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="res_layer1/branch1/conv1/conv1" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="256" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>400</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>300</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>400</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>300</dim>
				</port>
			</output>
			<blobs>
				<weights offset="16" size="1024"/>
			</blobs>
		</layer>
		<layer id="4" name="res_layer1/branch1/conv1_bn/conv1_bn_moments/mean" precision="FP32" type="Pooling">
			<data exclude-pad="true" kernel="400,1,300" pads_begin="0,0,0" pads_end="0,0,0" pool-method="avg" rounding-type="ceil" strides="1,1,1"/>
			<input>
				<port id="0">
					<dim>400</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>300</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="res_layer1/branch1/conv1_bn/conv1_bn_moments/SquaredDifference/negate_" precision="FP32" type="Power">
			<data power="1" scale="-1" shift="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="res_layer1/branch1/conv1_bn/conv1_bn_moments/SquaredDifference/add_/Broadcast/" precision="FP32" type="Tile">
			<data axis="0" tiles="400"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>400</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="res_layer1/branch1/conv1_bn/conv1_bn_moments/SquaredDifference/add_/Broadcast/2691" precision="FP32" type="Tile">
			<data axis="3" tiles="300"/>
			<input>
				<port id="0">
					<dim>400</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>400</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>300</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="res_layer1/branch1/conv1_bn/conv1_bn_moments/SquaredDifference/add_" precision="FP32" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>400</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>300</dim>
				</port>
				<port id="1">
					<dim>400</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>300</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>400</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>300</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="res_layer1/branch1/conv1_bn/conv1_bn_moments/SquaredDifference/squared_" precision="FP32" type="Power">
			<data power="2" scale="1" shift="0"/>
			<input>
				<port id="0">
					<dim>400</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>300</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>400</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>300</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="res_layer1/branch1/conv1_bn/conv1_bn_moments/variance" precision="FP32" type="Pooling">
			<data exclude-pad="true" kernel="400,1,300" pads_begin="0,0,0" pads_end="0,0,0" pool-method="avg" rounding-type="ceil" strides="1,1,1"/>
			<input>
				<port id="0">
					<dim>400</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>300</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="res_layer1/branch1/conv1_bn/conv1_bn_moments/Squeeze_1/DimData_const" precision="FP32" type="Const">
			<output>
				<port id="1">
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="1040" size="4"/>
			</blobs>
		</layer>
		<layer id="12" name="res_layer1/branch1/conv1_bn/conv1_bn_moments/Squeeze_1" precision="FP32" type="Reshape">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="res_layer1/branch1/conv1_bn/batchnorm/add" precision="FP32" type="Power">
			<data power="1" scale="1" shift="9.999999747378752e-06"/>
			<input>
				<port id="0">
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="res_layer1/branch1/conv1_bn/batchnorm/Rsqrt" precision="FP32" type="Power">
			<data power="-0.5" scale="1" shift="0"/>
			<input>
				<port id="0">
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="ScaleShift/res_layer1/branch1/conv1_bn/batchnorm/mul" precision="FP32" type="ScaleShift">
			<input>
				<port id="0">
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>256</dim>
				</port>
			</output>
			<blobs>
				<weights offset="1044" size="1024"/>
				<biases offset="2068" size="1024"/>
			</blobs>
		</layer>
		<layer id="16" name="res_layer1/branch1/conv1_bn/batchnorm/mul/Output_0/Data_/Broadcast/DimData_const" precision="FP32" type="Const">
			<output>
				<port id="1">
					<dim>4</dim>
				</port>
			</output>
			<blobs>
				<custom offset="3092" size="16"/>
			</blobs>
		</layer>
		<layer id="17" name="res_layer1/branch1/conv1_bn/batchnorm/mul/Output_0/Data_/Broadcast" precision="FP32" type="Reshape">
			<input>
				<port id="0">
					<dim>256</dim>
				</port>
				<port id="1">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="res_layer1/branch1/conv1_bn/batchnorm/mul_1/Broadcast/" precision="FP32" type="Tile">
			<data axis="0" tiles="400"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>400</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="res_layer1/branch1/conv1_bn/batchnorm/mul_1/Broadcast/2795" precision="FP32" type="Tile">
			<data axis="3" tiles="300"/>
			<input>
				<port id="0">
					<dim>400</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>400</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>300</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="res_layer1/branch1/conv1_bn/batchnorm/mul_1" precision="FP32" type="Eltwise">
			<data operation="mul"/>
			<input>
				<port id="0">
					<dim>400</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>300</dim>
				</port>
				<port id="1">
					<dim>400</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>300</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>400</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>300</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="res_layer1/branch1/conv1_bn/conv1_bn_moments/Squeeze/DimData_const" precision="FP32" type="Const">
			<output>
				<port id="1">
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="1040" size="4"/>
			</blobs>
		</layer>
		<layer id="22" name="res_layer1/branch1/conv1_bn/conv1_bn_moments/Squeeze" precision="FP32" type="Reshape">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="res_layer1/branch1/conv1_bn/batchnorm/mul_2" precision="FP32" type="Eltwise">
			<data operation="mul"/>
			<input>
				<port id="0">
					<dim>256</dim>
				</port>
				<port id="1">
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="res_layer1/branch1/conv1_bn/batchnorm/sub/negate_" precision="FP32" type="Power">
			<data power="1" scale="-1" shift="0"/>
			<input>
				<port id="0">
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="ScaleShift/res_layer1/branch1/conv1_bn/batchnorm/sub/add_" precision="FP32" type="ScaleShift">
			<input>
				<port id="0">
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>256</dim>
				</port>
			</output>
			<blobs>
				<weights offset="3108" size="1024"/>
				<biases offset="4132" size="1024"/>
			</blobs>
		</layer>
		<layer id="26" name="res_layer1/branch1/conv1_bn/batchnorm/sub/add_/Output_0/Data_/Broadcast/DimData_const" precision="FP32" type="Const">
			<output>
				<port id="1">
					<dim>4</dim>
				</port>
			</output>
			<blobs>
				<custom offset="3092" size="16"/>
			</blobs>
		</layer>
		<layer id="27" name="res_layer1/branch1/conv1_bn/batchnorm/sub/add_/Output_0/Data_/Broadcast" precision="FP32" type="Reshape">
			<input>
				<port id="0">
					<dim>256</dim>
				</port>
				<port id="1">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="res_layer1/branch1/conv1_bn/batchnorm/add_1/Broadcast/" precision="FP32" type="Tile">
			<data axis="0" tiles="400"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>400</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="res_layer1/branch1/conv1_bn/batchnorm/add_1/Broadcast/2715" precision="FP32" type="Tile">
			<data axis="3" tiles="300"/>
			<input>
				<port id="0">
					<dim>400</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>400</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>300</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="res_layer1/branch1/conv1_bn/batchnorm/add_1" precision="FP32" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>400</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>300</dim>
				</port>
				<port id="1">
					<dim>400</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>300</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>400</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>300</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="res_layer1/branch2/conv2a/conv2a" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="256" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>400</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>300</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>400</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>300</dim>
				</port>
			</output>
			<blobs>
				<weights offset="5156" size="1024"/>
			</blobs>
		</layer>
		<layer id="32" name="res_layer1/branch2/conv2a_bn/conv2a_bn_moments/mean" precision="FP32" type="Pooling">
			<data exclude-pad="true" kernel="400,1,300" pads_begin="0,0,0" pads_end="0,0,0" pool-method="avg" rounding-type="ceil" strides="1,1,1"/>
			<input>
				<port id="0">
					<dim>400</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>300</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="res_layer1/branch2/conv2a_bn/conv2a_bn_moments/SquaredDifference/negate_" precision="FP32" type="Power">
			<data power="1" scale="-1" shift="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="res_layer1/branch2/conv2a_bn/conv2a_bn_moments/SquaredDifference/add_/Broadcast/" precision="FP32" type="Tile">
			<data axis="0" tiles="400"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>400</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="res_layer1/branch2/conv2a_bn/conv2a_bn_moments/SquaredDifference/add_/Broadcast/2783" precision="FP32" type="Tile">
			<data axis="3" tiles="300"/>
			<input>
				<port id="0">
					<dim>400</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>400</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>300</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="res_layer1/branch2/conv2a_bn/conv2a_bn_moments/SquaredDifference/add_" precision="FP32" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>400</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>300</dim>
				</port>
				<port id="1">
					<dim>400</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>300</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>400</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>300</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="res_layer1/branch2/conv2a_bn/conv2a_bn_moments/SquaredDifference/squared_" precision="FP32" type="Power">
			<data power="2" scale="1" shift="0"/>
			<input>
				<port id="0">
					<dim>400</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>300</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>400</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>300</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="res_layer1/branch2/conv2a_bn/conv2a_bn_moments/variance" precision="FP32" type="Pooling">
			<data exclude-pad="true" kernel="400,1,300" pads_begin="0,0,0" pads_end="0,0,0" pool-method="avg" rounding-type="ceil" strides="1,1,1"/>
			<input>
				<port id="0">
					<dim>400</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>300</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="res_layer1/branch2/conv2a_bn/conv2a_bn_moments/Squeeze_1/DimData_const" precision="FP32" type="Const">
			<output>
				<port id="1">
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="1040" size="4"/>
			</blobs>
		</layer>
		<layer id="40" name="res_layer1/branch2/conv2a_bn/conv2a_bn_moments/Squeeze_1" precision="FP32" type="Reshape">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="res_layer1/branch2/conv2a_bn/batchnorm/add" precision="FP32" type="Power">
			<data power="1" scale="1" shift="9.999999747378752e-06"/>
			<input>
				<port id="0">
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="res_layer1/branch2/conv2a_bn/batchnorm/Rsqrt" precision="FP32" type="Power">
			<data power="-0.5" scale="1" shift="0"/>
			<input>
				<port id="0">
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="ScaleShift/res_layer1/branch2/conv2a_bn/batchnorm/mul" precision="FP32" type="ScaleShift">
			<input>
				<port id="0">
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>256</dim>
				</port>
			</output>
			<blobs>
				<weights offset="6180" size="1024"/>
				<biases offset="2068" size="1024"/>
			</blobs>
		</layer>
		<layer id="44" name="res_layer1/branch2/conv2a_bn/batchnorm/mul/Output_0/Data_/Broadcast/DimData_const" precision="FP32" type="Const">
			<output>
				<port id="1">
					<dim>4</dim>
				</port>
			</output>
			<blobs>
				<custom offset="3092" size="16"/>
			</blobs>
		</layer>
		<layer id="45" name="res_layer1/branch2/conv2a_bn/batchnorm/mul/Output_0/Data_/Broadcast" precision="FP32" type="Reshape">
			<input>
				<port id="0">
					<dim>256</dim>
				</port>
				<port id="1">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="res_layer1/branch2/conv2a_bn/batchnorm/mul_1/Broadcast/" precision="FP32" type="Tile">
			<data axis="0" tiles="400"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>400</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="res_layer1/branch2/conv2a_bn/batchnorm/mul_1/Broadcast/2735" precision="FP32" type="Tile">
			<data axis="3" tiles="300"/>
			<input>
				<port id="0">
					<dim>400</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>400</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>300</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="res_layer1/branch2/conv2a_bn/batchnorm/mul_1" precision="FP32" type="Eltwise">
			<data operation="mul"/>
			<input>
				<port id="0">
					<dim>400</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>300</dim>
				</port>
				<port id="1">
					<dim>400</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>300</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>400</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>300</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="res_layer1/branch2/conv2a_bn/conv2a_bn_moments/Squeeze/DimData_const" precision="FP32" type="Const">
			<output>
				<port id="1">
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="1040" size="4"/>
			</blobs>
		</layer>
		<layer id="50" name="res_layer1/branch2/conv2a_bn/conv2a_bn_moments/Squeeze" precision="FP32" type="Reshape">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="res_layer1/branch2/conv2a_bn/batchnorm/mul_2" precision="FP32" type="Eltwise">
			<data operation="mul"/>
			<input>
				<port id="0">
					<dim>256</dim>
				</port>
				<port id="1">
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="res_layer1/branch2/conv2a_bn/batchnorm/sub/negate_" precision="FP32" type="Power">
			<data power="1" scale="-1" shift="0"/>
			<input>
				<port id="0">
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="ScaleShift/res_layer1/branch2/conv2a_bn/batchnorm/sub/add_" precision="FP32" type="ScaleShift">
			<input>
				<port id="0">
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>256</dim>
				</port>
			</output>
			<blobs>
				<weights offset="3108" size="1024"/>
				<biases offset="7204" size="1024"/>
			</blobs>
		</layer>
		<layer id="54" name="res_layer1/branch2/conv2a_bn/batchnorm/sub/add_/Output_0/Data_/Broadcast/DimData_const" precision="FP32" type="Const">
			<output>
				<port id="1">
					<dim>4</dim>
				</port>
			</output>
			<blobs>
				<custom offset="3092" size="16"/>
			</blobs>
		</layer>
		<layer id="55" name="res_layer1/branch2/conv2a_bn/batchnorm/sub/add_/Output_0/Data_/Broadcast" precision="FP32" type="Reshape">
			<input>
				<port id="0">
					<dim>256</dim>
				</port>
				<port id="1">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="res_layer1/branch2/conv2a_bn/batchnorm/add_1/Broadcast/" precision="FP32" type="Tile">
			<data axis="0" tiles="400"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>400</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="res_layer1/branch2/conv2a_bn/batchnorm/add_1/Broadcast/2751" precision="FP32" type="Tile">
			<data axis="3" tiles="300"/>
			<input>
				<port id="0">
					<dim>400</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>400</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>300</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="res_layer1/branch2/conv2a_bn/batchnorm/add_1" precision="FP32" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>400</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>300</dim>
				</port>
				<port id="1">
					<dim>400</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>300</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>400</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>300</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="res_layer1/branch2/conv2a_relu/relu" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>400</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>300</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>400</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>300</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="res_layer1/branch2/conv2b/conv2b" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,3" output="256" pads_begin="0,1" pads_end="0,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>400</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>300</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>400</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>300</dim>
				</port>
			</output>
			<blobs>
				<weights offset="8228" size="786432"/>
			</blobs>
		</layer>
		<layer id="61" name="res_layer1/branch2/conv2b_bn/conv2b_bn_moments/mean" precision="FP32" type="Pooling">
			<data exclude-pad="true" kernel="400,1,300" pads_begin="0,0,0" pads_end="0,0,0" pool-method="avg" rounding-type="ceil" strides="1,1,1"/>
			<input>
				<port id="0">
					<dim>400</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>300</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="res_layer1/branch2/conv2b_bn/conv2b_bn_moments/SquaredDifference/negate_" precision="FP32" type="Power">
			<data power="1" scale="-1" shift="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="res_layer1/branch2/conv2b_bn/conv2b_bn_moments/SquaredDifference/add_/Broadcast/" precision="FP32" type="Tile">
			<data axis="0" tiles="400"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>400</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="res_layer1/branch2/conv2b_bn/conv2b_bn_moments/SquaredDifference/add_/Broadcast/2787" precision="FP32" type="Tile">
			<data axis="3" tiles="300"/>
			<input>
				<port id="0">
					<dim>400</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>400</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>300</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="res_layer1/branch2/conv2b_bn/conv2b_bn_moments/SquaredDifference/add_" precision="FP32" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>400</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>300</dim>
				</port>
				<port id="1">
					<dim>400</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>300</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>400</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>300</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="res_layer1/branch2/conv2b_bn/conv2b_bn_moments/SquaredDifference/squared_" precision="FP32" type="Power">
			<data power="2" scale="1" shift="0"/>
			<input>
				<port id="0">
					<dim>400</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>300</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>400</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>300</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="res_layer1/branch2/conv2b_bn/conv2b_bn_moments/variance" precision="FP32" type="Pooling">
			<data exclude-pad="true" kernel="400,1,300" pads_begin="0,0,0" pads_end="0,0,0" pool-method="avg" rounding-type="ceil" strides="1,1,1"/>
			<input>
				<port id="0">
					<dim>400</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>300</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="res_layer1/branch2/conv2b_bn/conv2b_bn_moments/Squeeze_1/DimData_const" precision="FP32" type="Const">
			<output>
				<port id="1">
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="1040" size="4"/>
			</blobs>
		</layer>
		<layer id="69" name="res_layer1/branch2/conv2b_bn/conv2b_bn_moments/Squeeze_1" precision="FP32" type="Reshape">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="res_layer1/branch2/conv2b_bn/batchnorm/add" precision="FP32" type="Power">
			<data power="1" scale="1" shift="9.999999747378752e-06"/>
			<input>
				<port id="0">
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="res_layer1/branch2/conv2b_bn/batchnorm/Rsqrt" precision="FP32" type="Power">
			<data power="-0.5" scale="1" shift="0"/>
			<input>
				<port id="0">
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="ScaleShift/res_layer1/branch2/conv2b_bn/batchnorm/mul" precision="FP32" type="ScaleShift">
			<input>
				<port id="0">
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>256</dim>
				</port>
			</output>
			<blobs>
				<weights offset="794660" size="1024"/>
				<biases offset="2068" size="1024"/>
			</blobs>
		</layer>
		<layer id="73" name="res_layer1/branch2/conv2b_bn/batchnorm/mul/Output_0/Data_/Broadcast/DimData_const" precision="FP32" type="Const">
			<output>
				<port id="1">
					<dim>4</dim>
				</port>
			</output>
			<blobs>
				<custom offset="3092" size="16"/>
			</blobs>
		</layer>
		<layer id="74" name="res_layer1/branch2/conv2b_bn/batchnorm/mul/Output_0/Data_/Broadcast" precision="FP32" type="Reshape">
			<input>
				<port id="0">
					<dim>256</dim>
				</port>
				<port id="1">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="res_layer1/branch2/conv2b_bn/batchnorm/mul_1/Broadcast/" precision="FP32" type="Tile">
			<data axis="0" tiles="400"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>400</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="res_layer1/branch2/conv2b_bn/batchnorm/mul_1/Broadcast/2743" precision="FP32" type="Tile">
			<data axis="3" tiles="300"/>
			<input>
				<port id="0">
					<dim>400</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>400</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>300</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="res_layer1/branch2/conv2b_bn/batchnorm/mul_1" precision="FP32" type="Eltwise">
			<data operation="mul"/>
			<input>
				<port id="0">
					<dim>400</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>300</dim>
				</port>
				<port id="1">
					<dim>400</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>300</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>400</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>300</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="res_layer1/branch2/conv2b_bn/conv2b_bn_moments/Squeeze/DimData_const" precision="FP32" type="Const">
			<output>
				<port id="1">
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="1040" size="4"/>
			</blobs>
		</layer>
		<layer id="79" name="res_layer1/branch2/conv2b_bn/conv2b_bn_moments/Squeeze" precision="FP32" type="Reshape">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="res_layer1/branch2/conv2b_bn/batchnorm/mul_2" precision="FP32" type="Eltwise">
			<data operation="mul"/>
			<input>
				<port id="0">
					<dim>256</dim>
				</port>
				<port id="1">
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="res_layer1/branch2/conv2b_bn/batchnorm/sub/negate_" precision="FP32" type="Power">
			<data power="1" scale="-1" shift="0"/>
			<input>
				<port id="0">
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="ScaleShift/res_layer1/branch2/conv2b_bn/batchnorm/sub/add_" precision="FP32" type="ScaleShift">
			<input>
				<port id="0">
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>256</dim>
				</port>
			</output>
			<blobs>
				<weights offset="3108" size="1024"/>
				<biases offset="795684" size="1024"/>
			</blobs>
		</layer>
		<layer id="83" name="res_layer1/branch2/conv2b_bn/batchnorm/sub/add_/Output_0/Data_/Broadcast/DimData_const" precision="FP32" type="Const">
			<output>
				<port id="1">
					<dim>4</dim>
				</port>
			</output>
			<blobs>
				<custom offset="3092" size="16"/>
			</blobs>
		</layer>
		<layer id="84" name="res_layer1/branch2/conv2b_bn/batchnorm/sub/add_/Output_0/Data_/Broadcast" precision="FP32" type="Reshape">
			<input>
				<port id="0">
					<dim>256</dim>
				</port>
				<port id="1">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="res_layer1/branch2/conv2b_bn/batchnorm/add_1/Broadcast/" precision="FP32" type="Tile">
			<data axis="0" tiles="400"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>400</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="res_layer1/branch2/conv2b_bn/batchnorm/add_1/Broadcast/2707" precision="FP32" type="Tile">
			<data axis="3" tiles="300"/>
			<input>
				<port id="0">
					<dim>400</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>400</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>300</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="res_layer1/branch2/conv2b_bn/batchnorm/add_1" precision="FP32" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>400</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>300</dim>
				</port>
				<port id="1">
					<dim>400</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>300</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>400</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>300</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="res_layer1/branch2/conv2b_relu/relu" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>400</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>300</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>400</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>300</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="res_layer1/branch2/conv2c/conv2c" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="256" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>400</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>300</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>400</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>300</dim>
				</port>
			</output>
			<blobs>
				<weights offset="796708" size="262144"/>
			</blobs>
		</layer>
		<layer id="90" name="res_layer1/branch2/conv2c_bn/conv2c_bn_moments/mean" precision="FP32" type="Pooling">
			<data exclude-pad="true" kernel="400,1,300" pads_begin="0,0,0" pads_end="0,0,0" pool-method="avg" rounding-type="ceil" strides="1,1,1"/>
			<input>
				<port id="0">
					<dim>400</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>300</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="res_layer1/branch2/conv2c_bn/conv2c_bn_moments/SquaredDifference/negate_" precision="FP32" type="Power">
			<data power="1" scale="-1" shift="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="res_layer1/branch2/conv2c_bn/conv2c_bn_moments/SquaredDifference/add_/Broadcast/" precision="FP32" type="Tile">
			<data axis="0" tiles="400"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>400</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="res_layer1/branch2/conv2c_bn/conv2c_bn_moments/SquaredDifference/add_/Broadcast/2699" precision="FP32" type="Tile">
			<data axis="3" tiles="300"/>
			<input>
				<port id="0">
					<dim>400</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>400</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>300</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="res_layer1/branch2/conv2c_bn/conv2c_bn_moments/SquaredDifference/add_" precision="FP32" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>400</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>300</dim>
				</port>
				<port id="1">
					<dim>400</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>300</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>400</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>300</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="res_layer1/branch2/conv2c_bn/conv2c_bn_moments/SquaredDifference/squared_" precision="FP32" type="Power">
			<data power="2" scale="1" shift="0"/>
			<input>
				<port id="0">
					<dim>400</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>300</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>400</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>300</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="res_layer1/branch2/conv2c_bn/conv2c_bn_moments/variance" precision="FP32" type="Pooling">
			<data exclude-pad="true" kernel="400,1,300" pads_begin="0,0,0" pads_end="0,0,0" pool-method="avg" rounding-type="ceil" strides="1,1,1"/>
			<input>
				<port id="0">
					<dim>400</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>300</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="res_layer1/branch2/conv2c_bn/conv2c_bn_moments/Squeeze_1/DimData_const" precision="FP32" type="Const">
			<output>
				<port id="1">
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="1040" size="4"/>
			</blobs>
		</layer>
		<layer id="98" name="res_layer1/branch2/conv2c_bn/conv2c_bn_moments/Squeeze_1" precision="FP32" type="Reshape">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="res_layer1/branch2/conv2c_bn/batchnorm/add" precision="FP32" type="Power">
			<data power="1" scale="1" shift="9.999999747378752e-06"/>
			<input>
				<port id="0">
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="res_layer1/branch2/conv2c_bn/batchnorm/Rsqrt" precision="FP32" type="Power">
			<data power="-0.5" scale="1" shift="0"/>
			<input>
				<port id="0">
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="ScaleShift/res_layer1/branch2/conv2c_bn/batchnorm/mul" precision="FP32" type="ScaleShift">
			<input>
				<port id="0">
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>256</dim>
				</port>
			</output>
			<blobs>
				<weights offset="1058852" size="1024"/>
				<biases offset="2068" size="1024"/>
			</blobs>
		</layer>
		<layer id="102" name="res_layer1/branch2/conv2c_bn/batchnorm/mul/Output_0/Data_/Broadcast/DimData_const" precision="FP32" type="Const">
			<output>
				<port id="1">
					<dim>4</dim>
				</port>
			</output>
			<blobs>
				<custom offset="3092" size="16"/>
			</blobs>
		</layer>
		<layer id="103" name="res_layer1/branch2/conv2c_bn/batchnorm/mul/Output_0/Data_/Broadcast" precision="FP32" type="Reshape">
			<input>
				<port id="0">
					<dim>256</dim>
				</port>
				<port id="1">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="104" name="res_layer1/branch2/conv2c_bn/batchnorm/mul_1/Broadcast/" precision="FP32" type="Tile">
			<data axis="0" tiles="400"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>400</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="105" name="res_layer1/branch2/conv2c_bn/batchnorm/mul_1/Broadcast/2771" precision="FP32" type="Tile">
			<data axis="3" tiles="300"/>
			<input>
				<port id="0">
					<dim>400</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>400</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>300</dim>
				</port>
			</output>
		</layer>
		<layer id="106" name="res_layer1/branch2/conv2c_bn/batchnorm/mul_1" precision="FP32" type="Eltwise">
			<data operation="mul"/>
			<input>
				<port id="0">
					<dim>400</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>300</dim>
				</port>
				<port id="1">
					<dim>400</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>300</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>400</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>300</dim>
				</port>
			</output>
		</layer>
		<layer id="107" name="res_layer1/branch2/conv2c_bn/conv2c_bn_moments/Squeeze/DimData_const" precision="FP32" type="Const">
			<output>
				<port id="1">
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="1040" size="4"/>
			</blobs>
		</layer>
		<layer id="108" name="res_layer1/branch2/conv2c_bn/conv2c_bn_moments/Squeeze" precision="FP32" type="Reshape">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="109" name="res_layer1/branch2/conv2c_bn/batchnorm/mul_2" precision="FP32" type="Eltwise">
			<data operation="mul"/>
			<input>
				<port id="0">
					<dim>256</dim>
				</port>
				<port id="1">
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="110" name="res_layer1/branch2/conv2c_bn/batchnorm/sub/negate_" precision="FP32" type="Power">
			<data power="1" scale="-1" shift="0"/>
			<input>
				<port id="0">
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="111" name="ScaleShift/res_layer1/branch2/conv2c_bn/batchnorm/sub/add_" precision="FP32" type="ScaleShift">
			<input>
				<port id="0">
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>256</dim>
				</port>
			</output>
			<blobs>
				<weights offset="3108" size="1024"/>
				<biases offset="1059876" size="1024"/>
			</blobs>
		</layer>
		<layer id="112" name="res_layer1/branch2/conv2c_bn/batchnorm/sub/add_/Output_0/Data_/Broadcast/DimData_const" precision="FP32" type="Const">
			<output>
				<port id="1">
					<dim>4</dim>
				</port>
			</output>
			<blobs>
				<custom offset="3092" size="16"/>
			</blobs>
		</layer>
		<layer id="113" name="res_layer1/branch2/conv2c_bn/batchnorm/sub/add_/Output_0/Data_/Broadcast" precision="FP32" type="Reshape">
			<input>
				<port id="0">
					<dim>256</dim>
				</port>
				<port id="1">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="114" name="res_layer1/branch2/conv2c_bn/batchnorm/add_1/Broadcast/" precision="FP32" type="Tile">
			<data axis="0" tiles="400"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>400</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="115" name="res_layer1/branch2/conv2c_bn/batchnorm/add_1/Broadcast/2791" precision="FP32" type="Tile">
			<data axis="3" tiles="300"/>
			<input>
				<port id="0">
					<dim>400</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>400</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>300</dim>
				</port>
			</output>
		</layer>
		<layer id="116" name="res_layer1/branch2/conv2c_bn/batchnorm/add_1" precision="FP32" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>400</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>300</dim>
				</port>
				<port id="1">
					<dim>400</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>300</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>400</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>300</dim>
				</port>
			</output>
		</layer>
		<layer id="117" name="res_layer1/plus/add" precision="FP32" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>400</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>300</dim>
				</port>
				<port id="1">
					<dim>400</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>300</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>400</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>300</dim>
				</port>
			</output>
		</layer>
		<layer id="118" name="res_layer1/plus/final_relu" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>400</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>300</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>400</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>300</dim>
				</port>
			</output>
		</layer>
		<layer id="119" name="res_layer2/branch1/conv1/conv1" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="256" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>400</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>300</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>400</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>300</dim>
				</port>
			</output>
			<blobs>
				<weights offset="1060900" size="262144"/>
			</blobs>
		</layer>
		<layer id="120" name="res_layer2/branch2/conv2a/conv2a" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="256" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>400</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>300</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>400</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>300</dim>
				</port>
			</output>
			<blobs>
				<weights offset="1323044" size="262144"/>
			</blobs>
		</layer>
		<layer id="121" name="res_layer2/branch2/conv2a_bn/conv2a_bn_moments/mean" precision="FP32" type="Pooling">
			<data exclude-pad="true" kernel="400,1,300" pads_begin="0,0,0" pads_end="0,0,0" pool-method="avg" rounding-type="ceil" strides="1,1,1"/>
			<input>
				<port id="0">
					<dim>400</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>300</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="122" name="res_layer2/branch2/conv2a_bn/conv2a_bn_moments/SquaredDifference/negate_" precision="FP32" type="Power">
			<data power="1" scale="-1" shift="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="123" name="res_layer2/branch2/conv2a_bn/conv2a_bn_moments/SquaredDifference/add_/Broadcast/" precision="FP32" type="Tile">
			<data axis="0" tiles="400"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>400</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
